/*
里面所有的符号格式必须是英文格式的
数据格式说明：
[]:表示列表，是所有元素的集合
{}:表示字典，里面就是每个元素的所有信息，{}如果在中间位置，后面需要加英文逗号: ,
网络路径：网址，
本地路径：保存在和文件同一台电脑设备的路径，
如：./images/brisbane Cropped.jpeg"，./：文件的相同目录，images：一个叫images的文件夹，brisbane Cropped.jpeg：图片名称
其他：../：表示文件的上一级目录
{
    "name": "名称",
    "amount": "金额",
    "currency": "币种",
    "amount_cny": "人民币金额",
    "date": "日期",
    "year": "年份"
}
 */

var data_input = [{
    "name": "深圳市地铁集团有限公司",
    "amount": " 1,000,000.00 ",
    "currency": "人民币",
    "amount_cny": " 1,000,000.00 ",
    "date": "2016/6/8",
    "year": "2016"
}, {
    "name": "广东阳明酒业有限公司",
    "amount": " 106,788.00 ",
    "currency": "人民币",
    "amount_cny": " 106,788.00 ",
    "date": "2016/6/12",
    "year": "2016"
}, {
    "name": "深圳市海云天投资控股有限公司",
    "amount": " 1,000,000.00 ",
    "currency": "人民币",
    "amount_cny": " 1,000,000.00 ",
    "date": "2016/6/13",
    "year": "2016"
}, {
    "name": "ZHANGWEI(张唯）",
    "amount": " 200,000.00 ",
    "currency": "人民币",
    "amount_cny": " 200,000.00 ",
    "date": "2016/6/14",
    "year": "2016"
}, {
    "name": "深圳如日升股权投资有限公司",
    "amount": " 200,000.00 ",
    "currency": "人民币",
    "amount_cny": " 200,000.00 ",
    "date": "2016/6/15",
    "year": "2016"
}, {
    "name": "深圳市盐田港集团有限公司",
    "amount": " 1,000,000.00 ",
    "currency": "人民币",
    "amount_cny": " 1,000,000.00 ",
    "date": "2016/7/28",
    "year": "2016"
}, {
    "name": "深圳市投资控股有限公司",
    "amount": " 1,000,000.00 ",
    "currency": "人民币",
    "amount_cny": " 1,000,000.00 ",
    "date": "2016/7/29",
    "year": "2016"
}, {
    "name": "深圳市机场（集团）有限公司",
    "amount": " 1,000,000.00 ",
    "currency": "人民币",
    "amount_cny": " 1,000,000.00 ",
    "date": "2016/8/3",
    "year": "2016"
}, {
    "name": "深圳市豪威光电薄膜装置有限公司",
    "amount": " 2,000,000.00 ",
    "currency": "人民币",
    "amount_cny": " 2,000,000.00 ",
    "date": "2016/8/17",
    "year": "2016"
}, {
    "name": "深能（香港）国际有限公司",
    "amount": " 1,000,000.00 ",
    "currency": "人民币",
    "amount_cny": " 1,000,000.00 ",
    "date": "2016/11/18",
    "year": "2016"
}, {
    "name": "深圳一电科技有限公司",
    "amount": " 500,000.00 ",
    "currency": "人民币",
    "amount_cny": " 500,000.00 ",
    "date": "2016/12/15",
    "year": "2016"
}, {
    "name": "比亚迪汽车工业有限公司",
    "amount": " 700,000.00 ",
    "currency": "人民币",
    "amount_cny": " 700,000.00 ",
    "date": "2016/12/26",
    "year": "2016"
}, {
    "name": "深圳市优必选科技有限公司",
    "amount": " 300,000.00 ",
    "currency": "人民币",
    "amount_cny": " 300,000.00 ",
    "date": "2017/10/10",
    "year": "2017"
}, {
    "name": "深圳市乐富天智能科技有限公司",
    "amount": " 1,000,000.00 ",
    "currency": "人民币",
    "amount_cny": " 1,000,000.00 ",
    "date": "2017/12/11",
    "year": "2017"
}, {
    "name": "深圳乐土生命科技投资有限公司",
    "amount": " 1,000,000.00 ",
    "currency": "人民币",
    "amount_cny": " 1,000,000.00 ",
    "date": "2017/12/15",
    "year": "2017"
}, {
    "name": "比亚迪汽车工业有限公司",
    "amount": " 500,000.00 ",
    "currency": "人民币",
    "amount_cny": " 500,000.00 ",
    "date": "2017/12/28",
    "year": "2017"
}, {
    "name": "深圳市海云天科技股份有限公司",
    "amount": " 250,000.00 ",
    "currency": "人民币",
    "amount_cny": " 250,000.00 ",
    "date": "2018/1/31",
    "year": "2018"
}, {
    "name": "万科公益基金会",
    "amount": " 200,000.00 ",
    "currency": "人民币",
    "amount_cny": " 200,000.00 ",
    "date": "2018/6/8",
    "year": "2018"
}, {
    "name": "盐田区委区政府",
    "amount": "1,000,000.00",
    "currency": "人民币",
    "amount_cny": "1,000,000.00",
    "date": "2014/9/11",
    "year": "2014"
}, {
    "name": "深圳市百佳华集团 有限公司",
    "amount": " 500,000.00 ",
    "currency": "人民币",
    "amount_cny": " 500,000.00 ",
    "date": "2014/9/26",
    "year": "2014"
}, {
    "name": "中兴通讯股份有限公司",
    "amount": " 1,000,000.00 ",
    "currency": "人民币",
    "amount_cny": " 1,000,000.00 ",
    "date": "2014/9/26",
    "year": "2014"
}, {
    "name": "银盛通信有限公司",
    "amount": " 1,000,000.00 ",
    "currency": "人民币",
    "amount_cny": " 1,000,000.00 ",
    "date": "2014/10/9",
    "year": "2014"
}, {
    "name": "深圳市人民政府",
    "amount": " 10,000,000.00 ",
    "currency": "人民币",
    "amount_cny": " 10,000,000.00 ",
    "date": "2014/10/13",
    "year": "2014"
}, {
    "name": "深圳市威苏威投资有限公司",
    "amount": " 1,000,000.00 ",
    "currency": "人民币",
    "amount_cny": " 1,000,000.00 ",
    "date": "2014/10/13",
    "year": "2014"
}, {
    "name": "深圳奥特迅电力设备股份有限公司",
    "amount": " 1,000,000.00 ",
    "currency": "人民币",
    "amount_cny": " 1,000,000.00 ",
    "date": "2014/10/14",
    "year": "2014"
}, {
    "name": "深圳市工业设计协会",
    "amount": " 200,000.00 ",
    "currency": "人民币",
    "amount_cny": " 200,000.00 ",
    "date": "2014/10/16",
    "year": "2014"
}, {
    "name": "龙华新区管理委员会",
    "amount": " 3,000,000.00 ",
    "currency": "人民币",
    "amount_cny": " 3,000,000.00 ",
    "date": "2014/10/17",
    "year": "2014"
}, {
    "name": "深圳市华强公益基金会",
    "amount": " 1,000,000.00 ",
    "currency": "人民币",
    "amount_cny": " 1,000,000.00 ",
    "date": "2014/10/29",
    "year": "2014"
}, {
    "name": "深圳市国威电子有限公司",
    "amount": " 1,000,000.00 ",
    "currency": "人民币",
    "amount_cny": " 1,000,000.00 ",
    "date": "2014/10/30",
    "year": "2014"
}, {
    "name": "腾邦投资控股有限公司",
    "amount": " 1,000,000.00 ",
    "currency": "人民币",
    "amount_cny": " 1,000,000.00 ",
    "date": "2014/10/31",
    "year": "2014"
}, {
    "name": "光明新区管理委员会",
    "amount": " 2,000,000.00 ",
    "currency": "人民币",
    "amount_cny": " 2,000,000.00 ",
    "date": "2014/11/3",
    "year": "2014"
}, {
    "name": "和计黄埔有限公司",
    "amount": " 3,000,000.00 ",
    "currency": "港币",
    "amount_cny": " 2,383,620.00 ",
    "date": "2014/11/7",
    "year": "2014"
}, {
    "name": "天大集团有限公司",
    "amount": " 1,000,000.00 ",
    "currency": "港币",
    "amount_cny": " 791,700.00 ",
    "date": "2014/11/10",
    "year": "2014"
}, {
    "name": "佳宁娜（深圳）投资有限公司55万/深圳佳宁娜饮食有限公司45万",
    "amount": " 1,000,000.00 ",
    "currency": "人民币",
    "amount_cny": " 1,000,000.00 ",
    "date": "2014/11/12",
    "year": "2014"
}, {
    "name": "佳宁娜友谊广场物业管理（深圳）有限公司",
    "amount": " 500,000.00 ",
    "currency": "人民币",
    "amount_cny": " 500,000.00 ",
    "date": "2014/11/12",
    "year": "2014"
}, {
    "name": "孙荣聪",
    "amount": " 1,000,000.00 ",
    "currency": "人民币",
    "amount_cny": " 1,000,000.00 ",
    "date": "2014/11/14",
    "year": "2014"
}, {
    "name": "大鹏新区管理委员会",
    "amount": " 1,000,000.00 ",
    "currency": "人民币",
    "amount_cny": " 1,000,000.00 ",
    "date": "2014/11/14",
    "year": "2014"
}, {
    "name": "宝安区委区政府",
    "amount": " 3,000,000.00 ",
    "currency": "人民币",
    "amount_cny": " 3,000,000.00 ",
    "date": "2014/11/19",
    "year": "2014"
}, {
    "name": "南山区委区政府",
    "amount": " 3,000,000.00 ",
    "currency": "人民币",
    "amount_cny": " 3,000,000.00 ",
    "date": "2014/11/25",
    "year": "2014"
}, {
    "name": "中国南方航空股份有限公司",
    "amount": " 200,000.00 ",
    "currency": "人民币",
    "amount_cny": " 200,000.00 ",
    "date": "2014/11/24",
    "year": "2014"
}, {
    "name": "深圳市三诺电子有限公司",
    "amount": " 300,000.00 ",
    "currency": "人民币",
    "amount_cny": " 300,000.00 ",
    "date": "2014/11/27",
    "year": "2014"
}, {
    "name": "福田区委区政府",
    "amount": " 3,000,000.00 ",
    "currency": "人民币",
    "amount_cny": " 3,000,000.00 ",
    "date": "2014/12/5",
    "year": "2014"
}, {
    "name": "深圳信息职业学院",
    "amount": " 1,000,000.00 ",
    "currency": "人民币",
    "amount_cny": " 1,000,000.00 ",
    "date": "2014/12/10",
    "year": "2014"
}, {
    "name": "龙岗区委区政府",
    "amount": " 3,000,000.00 ",
    "currency": "人民币",
    "amount_cny": " 3,000,000.00 ",
    "date": "2014/12/16",
    "year": "2014"
}, {
    "name": "坪山新区管理委员会",
    "amount": " 3,000,000.00 ",
    "currency": "人民币",
    "amount_cny": " 3,000,000.00 ",
    "date": "2014/12/18",
    "year": "2014"
}, {
    "name": "关恩赐",
    "amount": " 1,000,000.00 ",
    "currency": "港币",
    "amount_cny": " 789,210.00 ",
    "date": "2014/12/19",
    "year": "2014"
}, {
    "name": "刘红英",
    "amount": " 500,000.00 ",
    "currency": "港币",
    "amount_cny": " 394,605.00 ",
    "date": "2014/12/19",
    "year": "2014"
}, {
    "name": "罗湖区人民政府",
    "amount": " 3,000,000.00 ",
    "currency": "人民币",
    "amount_cny": " 3,000,000.00 ",
    "date": "2014/12/23",
    "year": "2014"
}, {
    "name": "华为技术有限公司",
    "amount": " 1,500,000.00 ",
    "currency": "人民币",
    "amount_cny": " 1,500,000.00 ",
    "date": "2014/12/25",
    "year": "2014"
}, {
    "name": "深圳市玛莎嘉儿连锁实业有限公司",
    "amount": " 500,000.00 ",
    "currency": "人民币",
    "amount_cny": " 500,000.00 ",
    "date": "2014/12/30",
    "year": "2014"
}, {
    "name": "深圳市木子文化艺术有限公司",
    "amount": " 200,000.00 ",
    "currency": "人民币",
    "amount_cny": " 200,000.00 ",
    "date": "2014/12/30",
    "year": "2014"
}, {
    "name": "深圳市华运国际物流有限公司",
    "amount": " 500,000.00 ",
    "currency": "人民币",
    "amount_cny": " 500,000.00 ",
    "date": "2014/12/30",
    "year": "2014"
}, {
    "name": "深圳大学建筑设计研究院 ",
    "amount": " 300,000.00 ",
    "currency": "人民币",
    "amount_cny": " 300,000.00 ",
    "date": "2014/12/30",
    "year": "2014"
}, {
    "name": "海能达通信股份有限公司",
    "amount": " 1,000,000.00 ",
    "currency": "人民币",
    "amount_cny": " 1,000,000.00 ",
    "date": "2014/12/30",
    "year": "2014"
}, {
    "name": "吴荣基",
    "amount": " 500,000.00 ",
    "currency": "人民币",
    "amount_cny": " 500,000.00 ",
    "date": "2014/12/30",
    "year": "2014"
}, {
    "name": "珠海市祥祺房地产开发有限公司",
    "amount": " 1,000,000.00 ",
    "currency": "人民币",
    "amount_cny": " 1,000,000.00 ",
    "date": "2015/1/6",
    "year": "2015"
}, {
    "name": "深圳市中意集团有限公司",
    "amount": " 1,000,000.00 ",
    "currency": "人民币",
    "amount_cny": " 1,000,000.00 ",
    "date": "2015/1/7",
    "year": "2015"
}, {
    "name": "深圳市新世界房地产开发有限公司",
    "amount": " 500,000.00 ",
    "currency": "人民币",
    "amount_cny": " 500,000.00 ",
    "date": "2015/1/7",
    "year": "2015"
}, {
    "name": "创维集团有限公司",
    "amount": " 1,000,000.00 ",
    "currency": "人民币",
    "amount_cny": " 1,000,000.00 ",
    "date": "2015/1/7",
    "year": "2015"
}, {
    "name": "余彭年管理（深圳）有限公司",
    "amount": " 1,080,000.00 ",
    "currency": "人民币",
    "amount_cny": " 1,080,000.00 ",
    "date": "2015/1/7",
    "year": "2015"
}, {
    "name": "深圳职业技术学院",
    "amount": " 1,000,000.00 ",
    "currency": "人民币",
    "amount_cny": " 1,000,000.00 ",
    "date": "2015/3/5",
    "year": "2015"
}, {
    "name": "深圳市深大极光科技有限公司",
    "amount": " 300,000.00 ",
    "currency": "人民币",
    "amount_cny": " 300,000.00 ",
    "date": "2015/3/16",
    "year": "2015"
}, {
    "name": "古少明",
    "amount": " 1,000,000.00 ",
    "currency": "人民币",
    "amount_cny": " 1,000,000.00 ",
    "date": "2015/12/16",
    "year": "2015"
}, {
    "name": "比亚迪汽车工业有限公司",
    "amount": " 300,000.00 ",
    "currency": "人民币",
    "amount_cny": " 300,000.00 ",
    "date": "2015/12/21",
    "year": "2015"
}, {
    "name": "深圳市英威腾电气股份有限公司",
    "amount": " 200,000.00 ",
    "currency": "人民币",
    "amount_cny": " 200,000.00 ",
    "date": "2016/1/12",
    "year": "2016"
}, {
    "name": "深圳市中航健康时尚集团股份有限公司",
    "amount": " 200,000.00 ",
    "currency": "人民币",
    "amount_cny": " 200,000.00 ",
    "date": "2016/3/9",
    "year": "2016"
}, {
    "name": "深圳市新世界房地产开发有限公司",
    "amount": " 500,000.00 ",
    "currency": "人民币",
    "amount_cny": " 500,000.00 ",
    "date": "2016/5/17",
    "year": "2016"
}, {
    "name": "万科公益基金会",
    "amount": " 1,000,000 ",
    "currency": "人民币",
    "amount_cny": " 1,000,000 ",
    "date": "2018/12/27",
    "year": "2018"
}, {
    "name": "深圳市远致投资有限公司",
    "amount": " 1,000,000.00 ",
    "currency": "人民币",
    "amount_cny": " 1,000,000.00 ",
    "date": "2016/6/7",
    "year": "2016"
}]
