var data = [
    {
        time: "2017/11",
        title: "首期共享经济特区建设经验成功试水",
        content: "基金会联合一带一路国际合作发展（深圳）研究院为<b>柬埔寨民间组织考察团</b>举办培训班。",
        level: "1"
    },{
        time: "2017/12",
        title: "“深系澜湄”品牌项目集群正式发布",
        content: "<b>首期四大项目</b>包括“共享经济特区建设经验”、“湄公河太阳村”、“地中海贫血和耳聋基因筛查”及“湄公河光明行”。",
        level: "1"
    },{
        time: "2018/1",
        title: "第二期共享经济特区建设经验成功举办",
        content: "基金会在深圳大学为<b>越南广宁省</b>代表团举办<b>第二期共享经济特区建设经验培训班</b>。",
        level: "1"
    },{
        time: "2018/1",
        title: "三大项目入选澜湄合作项目清单",
        content: "<b>“共享经济特区建设经验”</b>、<b>“地中海贫血和耳聋基因筛查”</b>和<b>“湄公河太阳村”</b>在第二次澜湄合作领导人会议上被正式列入澜湄合作第二批项目清单。",
        level: "1"
    },{
        time: "2018/4",
        title: "入选南南合作援助基金会申请机构名录",
        content: "基金会作为全国首个地方性社会组织入选<b>南南合作援助基金</b>申请机构名录。",
        level: "1"
    },{
        time: "2018/5",
        title: "第三期共享经济特区建设经验落地柬埔寨",
        content: "基金会携手<b>联合国工业发展组织</b>与柬埔寨发展理事会共同在<b>柬埔寨金边</b>举办“深圳经济特区发展经验分享论坛”。",
        level: "1"
    },{
        time: "2018/5",
        title: "携手中促会，海外民生项目正式启动",
        content: "在中国民间组织国际交流促进会的协调下，基金会与柬埔寨民间社会组织联盟论坛在柬正式签署<b>“湄公河太阳村”项目合作协议以及“湄公河光明行”项目合作备忘录</b>，“深系澜湄”海外民生项目正式启动。",
        level: "1"
    },{
        time: "2018/7",
        title: "协办澜湄合作六国秘书处/协调机构培训，第四期共享经济特区建设经验在深举行",
        content: "中国外交部澜湄合作秘书处组织<b>澜湄合作六国秘书处/协调机构代表团</b>来深访问，基金会联合一带一路国际合作发展（深圳）研究院在深举办专题讲座并带队走访深圳企业及机构。",
        level: "1"
    },{
        time: "2018/9",
        title: "“湄公河太阳村”项目落地",
        content: "基金会在柬举行<b>“湄公河太阳村”设备交接仪式</b>，首个海外民生项目正式落地。",
        level: "1"
    },{
        time: "2018/12",
        title: "联手国家发改委·聚焦澜湄产能合作，第五期共享经济特区建设经验",
        content: "基金会与国家发改委国际合作中心合作，在深举办<b>“澜湄国家产能与投资合作促进系列活动·深圳站”</b>研讨会，接待澜湄五国主管经济、工业、园区发展的官员。",
        level: "1"
    },
]

